app/controllers/google_controller.rb

INSERT INTO "users" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-09-02 22:54:40.310556"], ["updated_at", "2015-09-02 22:54:40.310556"]]
---
  def callback

    auth = env["omniauth.auth"]
    user = User.new
    user.uid = auth.uid
    user.name = auth.info.name
    user.oauth_token = auth.credentials.token
    user.oauth_expires_at = Time.at(auth.credentials.expires_at)
    user.save!